WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
//   syslog(1, "SQR1: 0x%08x SQR2: 0x%08x SQR3: 0x%08x\n",
//         getreg32(baseADCAddr + STM32_ADC_SQR1_OFFSET),
//         getreg32(baseADCAddr + STM32_ADC_SQR2_OFFSET),
//         getreg32(baseADCAddr + STM32_ADC_SQR3_OFFSET));

//   syslog(1, "CCR:  0x%08x\n", getreg32(STM32_ADC_CCR));
// }

// //-----------------------------------------------------------------------
// static void adc_test_display_basic_dma_regs(void)
// {
//   syslog(1, "S0CR:  0x%08x  S0NDTR: 0x%08x\n",
//         getreg32(STM32_DMA2_S0CR),
//         getreg32(STM32_DMA2_S0NDTR));

//   syslog(1, "S0PAR: 0x%08x  S0M0AR: 0x%08x S0M1AR: 0x%08x\n",
//         getreg32(STM32_DMA2_S0PAR),
//         getreg32(STM32_DMA2_S0M0AR),
//         getreg32(STM32_DMA2_S0M1AR));
// }

// /************************************************************************************
//  * Private Data
//  ************************************************************************************/
// From data sheet - GPIO to ADC1 channel input map
// Entries represent the STM32F7's valid GPIOs the can be used for ADC
static uint8_t _gpioAdcChanMap[] =
{
  0x00,      // Chan 0 = PA0
  0x01,      // Chan 1 = PA1
  0x02,      // Chan 2 = PA2
  0x03,      // Chan 3 = PA3
  0x04,      // Chan 4 = PA4
  0x05,      // Chan 5 = PA5
  0x06,      // Chan 6 = PA6
  0x07,      // Chan 7 = PA7
  0x10,      // Chan 8 = PB0
  0x11,      // Chan 9 = PB1
  0x20,      // Chan 10 = PC0
  0x21,      // Chan 11 = PC1
  0x22,      // Chan 12 = PC2
  0x23,      // Chan 13 = PC3
  0x24,      // Chan 14 = PC4
  0x25,      // Chan 15 = PC5
};
#define MEADOW_ADC_GPIO_CHAN_MAP_LENGTH (sizeof(_gpioAdcChanMap))

volatile uint16_t *_dmaDataBuf;
uint16_t *_userDataBuf;

DMA_HANDLE _dmaHandle;
static uint32_t _adcBufSzBytes;
static uint32_t _gpioTransferCount;
static uint8_t *_gpioList;
static bool _meadowAdcInit = false;
static sem_t _waitTillDoneSem;

static int _noChangeCnt;
static bool _previousA00High = false;
  
// /************************************************************************************
//  * Private Function Prototypes
//  ************************************************************************************/

static int get_in_chan_from_pinid(uint32_t pinId, uint32_t *adcInputChan);
static int populate_adc_seq_channel(uint32_t *regval, uint32_t seqRegMaxGpios,
          uint32_t initRegShift);
static int meadow_adc_initialize(void);

static void show_all_data_in_buffer(char *headerText, uint16_t dataBuffer[],
                            uint32_t dataBufElements);

/************************************************************************************
 * Private Functions
 ************************************************************************************/
static void meadow_adc_buffer_takesem(sem_t *semaphore)
{
  int ret;
  do
  {
    ret = sem_wait(semaphore);
  }
  while (ret == -EINTR);
}

//==========================================================================
// Find ADC input channel (0-16) from the provided GPIO input port/pin
static int get_in_chan_from_pinid(uint32_t pinId, uint32_t *adcInputChan)
{
  int mapOff;

  // Look for match
  for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
  {
    if(pinId == _gpioAdcChanMap[mapOff])
    {
      *adcInputChan = mapOff;
      return OK;
    }
  }

  // Return error since no GPIO matched any valid analog input GPIOs
  return -EBADSLT;    // 55 - Invalid Slot
}

//======================================================================
// Helps fill the sequence registers
static int populate_adc_seq_channel(uint32_t *regval, uint32_t seqRegMaxGpios,
          uint32_t initRegShift)
{
  int ret;
  uint32_t regCnt;
  uint32_t adcInputChan;

  // Cycle through all the slots in this register
  for(regCnt = 0; regCnt < seqRegMaxGpios; regCnt++)
  {
    // For entry x what 'ADC input' channel
    ret = get_in_chan_from_pinid(_gpioList[regCnt], &adcInputChan);
    if(ret < 0)
      return ret;    // Error

    *regval |= (adcInputChan << (initRegShift + (regCnt * 5)));
  }
  return OK;
}

//==========================================================================
// DMA ISR
static void adc_dma_interrupt_handler_isr(DMA_HANDLE handle, uint8_t status,
            FAR void *arg)
{
  uint32_t regval;
  // uint32_t baseADCAddr = (uint32_t)arg;
  // static int execCnt = 0;

  // Without this call the buffer's data is usually not correct
  up_invalidate_dcache((uintptr_t)_dmaDataBuf,
                       (uintptr_t)_dmaDataBuf + _adcBufSzBytes);

  // The DMA controller hardware can be programmed to call for the following
  // Discription        Event Flag    Enable control bit
  // -----------        ----------    ------------------
  // Half-transfer          HTIF            HTIE
  // Transfer complete      TCIF            TCIE
  // Transfer error         TEIF            TEIE
  // FIFO overrun/underrun  FEIF            FEIE
  // Direct mode error      DMEIF           DMEIE

  // Note: The interrupt has already been handled in the STM32_DMA_LISR_OFFSET
  // or STM32_DMA_HISR_OFFSET registers by the Nuttx code in stm32_dma.c This
  // function stm32_dmainterrupt() in nuttx/arch/arm/src/stm32/stm32_dma_v2.c,
  // is the function whose call that got us here.
  // The interrupt values are in the 8 bit 'status' field. The fields can be
  // found in: nuttx/arch/arm/src/stm32f7/chip/stm32f76xx77xx_dma.h

  if(status == 0)
  {
    syslog(1, "DMA ISR No Interrupts\n");
    return;
  }

  // Bit 0: Stream FIFO error interrupt flag
  if((status & DMA_STREAM_FEIF_BIT) != 0)
  {
    syslog(1, "DMA ISR reason:FIFO error\n");
  }

  // Bit 2: Stream direct mode error interrupt flag
  if((status & DMA_STREAM_DMEIF_BIT) != 0)
  {
    syslog(1, "DMA ISR reason:direct mode error\n");
  }

  // Bit 3: Stream Transfer Error flag
  if((status & DMA_STREAM_TEIF_BIT) != 0)
  {
    // CTEIF
    syslog(1, "DMA ISR reason:Transfer Error\n");
  }
  
