WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  //------------------------------------------------------
  // Stream Half Transfer flag
  if((status & DMA_STREAM_HTIF_BIT) != 0)
  {
    // syslog(1, "DMA ISR reason:Half Transfer\n");
  }

  //------------------------------------------------------
  // Stream Transfer Complete flag
  if((status & DMA_STREAM_TCIF_BIT) != 0)
  {
    // syslog(1, ">>>>> DMA:Transfer complete\n");

    // The following code is for testing using the following connections:
    // Connect one end of a 2k2 resistor to DEBUG_PIN_CCM_D04_PB9 and the other
    // end connected to two 4k7 resistors. Then connect the free end of one 4k7
    // resistor's to ground and connect the another 4k7 resistor's free end to
    // 3v3, the voltage at the junction, of the 3 resistors, will toggle about
    // 1 volt above and 1 volt below mid-way between ground and 3v3 when
    // DEBUG_PIN_CCM_D04_PB9 changes from high to low. With this junction
    // connected to an analog input pin it is easy to prove that all of the
    // ADC values are changing as desired.
    //
    // Look at the ADC value for GPIO_V2_A00_IN4_PA4. It should
    // change on every DMA transfer complete interrupt.
    if(_dmaDataBuf[0] > 2048)
    {
      // Voltage above the mid point "high"
      DEBUG_SET_LOW(DEBUG_PIN_CCM_D04_PB9);
      if(_previousA00High)
        _noChangeCnt++;             // Still high
      else
        _previousA00High = true;    // Changed
    }
    else
    {
      // Voltage below the mid-point "low"
      DEBUG_SET_HIGH(DEBUG_PIN_CCM_D04_PB9);
      if(_previousA00High)
        _previousA00High = false;   // Changed
      else
        _noChangeCnt++;             // Still low
    }

// (--) Needed?
    // Restore the transfer count
    regval = getreg32(STM32_DMA2_S0NDTR);
    if(regval == 0)
    {
      regval &= ~0x0000ffff;      // Clear 15:0
      regval = _gpioTransferCount;
      putreg32(regval, STM32_DMA2_S0NDTR);
      // regval = getreg32(STM32_DMA2_S0NDTR);
      // syslog(1, "DMA:Transfer complete. SxNDTR was 0 now:%lu\n", regval);
    }

    // Now DMA2's SxCR register's will need to be re-enabled after each
    // conversion. This is because it's cleared whenever an a DMA transfer
    // has been completed.
// (--) Needed?
    regval  = getreg32(STM32_DMA2_S0CR);
    regval |= DMA_SCR_EN;
    putreg32(regval, STM32_DMA2_S0CR);

    // From Ref Man 15.8.1
    // At the end of the last DMA transfer (number of transfers configured in the
    // DMA controller’s DMA_SxNTR register):
    // • No new DMA request is issued to the DMA controller if the DDS bit is
    // cleared to 0 in the ADC_CR2 register (this avoids generating an overrun
    // error). However the DMA bit is not cleared by hardware. It must be written
    // to 0, then to 1 to start a new transfer.
    // • Requests can continue to be generated if the DDS bit is set to 1. This
    // allows configuring the DMA in double-buffer circular mode.
    // (--) Needed?
    regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
    regval &= ~ADC_CR2_DMA;
    putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

    regval |= ADC_CR2_DMA;
    putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

    // Wakeup callers thread
    sem_post(&_waitTillDoneSem);
  }
}

//==========================================================================
// ADC conversion ISR
static int adc_conversion_interrupt_handler_isr(int irq, FAR void *context,
            FAR void *arg)
{
  // The interrupt conversion can be programmed to be called for the following
  // Discription                          Event Flag    Enable control bit
  // -----------                          ----------    ------------------
  // End of conversion of a regular group     EOC             EOCIE
  // End of conversion of an injected group   JEOC            JEOCIE
  // Analog watchdog status bit is set        AWD             AWDIE
  // Overrun                                  OVR             OVRIE
  uint32_t pendingInterrupts;
  uint32_t baseADCAddr = (uint32_t)arg;

  pendingInterrupts = getreg32(baseADCAddr + STM32_ADC_SR_OFFSET);
  if(pendingInterrupts == 0)
  {
    syslog(1, "-- ADC ISR-NO Interrupts --\n");
    return OK;
  }

  if ((pendingInterrupts & ADC_SR_AWD) != 0)
  {
    syslog(1, "-- ADC ISR-WatchDog --\n");
  }

  if ((pendingInterrupts & ADC_SR_OVR) != 0)
  {
    syslog(1, "-- ADC ISR-Over Run --\n");

  // Note: ignoring data Overruns
  // From Ref Man 15.8.1 & 15.8.2
  // To recover the ADC from OVR when the DMA is used, follow the steps below:
  // 1. Reinitialize the DMA (adjust destination address and NDTR counter). This is DMA
  // 2. Clear the ADC OVR bit in ADC_SR register (below)  This is ADC
  // 3. Trigger the ADC to start the conversion (below)   This is ADC
  //
  // (--) #1 above - there doesn't appear to be in the stm32f7/stm32_dma.c
  // code a function to "Reinitialize the DMA".
  // See nuttx/arch/arm/src/stm32f7/stm32_dma.c @657-673 for code that would
  // do the above requirement (I think).
  }

  // End of conversion - got a value?
  if ((pendingInterrupts & ADC_SR_EOC) != 0)
  {
    syslog(1, "-- ADC ISR-End of Conversion --\n");
  }

  // Clear any interrupts
  pendingInterrupts &= ~ADC_ALL_POSSIBLE_ADC_INTERRUPTS;
  putreg32(pendingInterrupts, baseADCAddr + STM32_ADC_SR_OFFSET);

  return OK;
  // END IF ADC ISR
}

//======================================================================
// Assumes ADC 1
static int adc_initialize (void)
{
  uint32_t regval;

  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D00_PI9);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D01_PH13);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D02_PH10);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D03_PB8);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D04_PB9);

  // adc_test_display_basic_adc_regs(STM32_ADC1_BASE);

  // Insure the correct ADC clock is on. If not enabled it was impossible
  // to successfully write values into some ADC configuration registers.
  // (--) NEEDED ?
  regval = getreg32(STM32_RCC_APB2ENR);
  regval |= RCC_APB2ENR_ADC1EN;
  putreg32(regval, STM32_RCC_APB2ENR);

  regval = getreg32(STM32_RCC_AHB1ENR);
  regval |= RCC_AHB1ENR_DMA2EN;
  putreg32(regval, STM32_RCC_AHB1ENR);

