WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // All Pins available
  if(_gpioTransferCount == 6)
  {
    regval |= (4  << ADC_SQR3_SQ1_SHIFT);   // Channel 4  - A00 [PA4]->ADC123_IN4
    regval |= (5  << ADC_SQR3_SQ2_SHIFT);   // Channel 5  - A01 [PA5]->ADC123_IN5
    regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3  - A02 [PA3]->ADC123_IN3
    regval |= (8  << ADC_SQR3_SQ4_SHIFT);   // Channel 8  - A03 [PB0]->ADC12_IN8
    regval |= (9  << ADC_SQR3_SQ5_SHIFT);   // Channel 9  - A04 [PB1]->ADC12_IN9
    regval |= (10 << ADC_SQR3_SQ6_SHIFT);   // Channel 10 - A05 [PC0]->ADC123_IN10
  }
  else if (_gpioTransferCount == 3)
  {
    regval |= (4  << ADC_SQR3_SQ1_SHIFT);   // Channel 4  - A00 [PA4]->ADC123_IN4
    regval |= (5  << ADC_SQR3_SQ2_SHIFT);   // Channel 5  - A01 [PA5]->ADC123_IN5
    regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3  - A02 [PA3]->ADC123_IN3
  }
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR1_OFFSET);
  //? regval &= ADC_SQR1_RESERVED;            // Clear all SQR Bits
  regval |= ((_gpioTransferCount - 1) << ADC_SQR1_L_SHIFT);    // A 5 will convert 6
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR1_OFFSET);
#else
  // BEGIN - CARRIED FROM non-working meadow_adc.c
// THE FOLLOWING HAS BEEN PARTIAL TESTED - BUT THE ABOVE IS DOING THE WORK
// WHILE TESTING  
  int ret;
  uint32_t seqRegMaxGpios;
  uint32_t remainingCnt = _gpioTransferCount;

  // Sequence Register 3 - ADC channels 1-6
  seqRegMaxGpios = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
  if(remainingCnt < MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
    seqRegMaxGpios = remainingCnt;

  regval = getreg32(STM32_ADC1_SQR3);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  ret = populate_adc_seq_channel(&regval, seqRegMaxGpios, ADC_SQR3_SQ1_SHIFT);
  if(ret < 0)
    return ret;    // Error
  putreg32(regval, STM32_ADC1_SQR3);
  remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;

  // Sequence Register 2 - ADC channels 7-12
  if(remainingCnt > 0)
  {
    seqRegMaxGpios = MEADOW_ADC_SEQ_2_REGISTER_TOTAL;
    if(remainingCnt < MEADOW_ADC_SEQ_2_REGISTER_TOTAL)
      seqRegMaxGpios = remainingCnt;

    regval = getreg32(STM32_ADC1_SQR2);
    regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
    ret = populate_adc_seq_channel(&regval, seqRegMaxGpios, ADC_SQR2_SQ7_SHIFT);
    if(ret < 0)
      return ret;    // Error
    putreg32(regval, STM32_ADC1_SQR2);
    remainingCnt -= MEADOW_ADC_SEQ_2_REGISTER_TOTAL;
  }
 
  // Sequence Register 1 - ADC channels (13-16)
  if(remainingCnt > 0)
  {
    seqRegMaxGpios = MEADOW_ADC_SEQ_1_REGISTER_TOTAL;
    if(remainingCnt < MEADOW_ADC_SEQ_1_REGISTER_TOTAL)
      seqRegMaxGpios = remainingCnt;

    regval = getreg32(STM32_ADC1_SQR1);
    regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
    ret = populate_adc_seq_channel(&regval, seqRegMaxGpios, ADC_SQR1_SQ13_SHIFT);
    if(ret < 0)
      return ret;    // Error
    putreg32(regval, STM32_ADC1_SQR1);
  }

  // Last set the size
  regval = getreg32(STM32_ADC1_SQR1);
  regval |= ((_gpioTransferCount - 1) << ADC_SQR1_L_SHIFT);
  putreg32(regval, STM32_ADC1_SQR1);
  // END - CARRIED FROM non-working meadow_adc.c
#endif

  //------------------------------------------------------------
  // ADC Common Control Register (CCR) [Common == for all ADCs]
  regval = getreg32(STM32_ADC_CCR);
  // regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  // regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel

  // ADCPRE - Calculation based on PCLK2=96MHz (with 192MHz clock). Per Data
  // Sheet 5.3.24 pp 165, max ADC clock is 36MHz. Therefore, divide by 4
  // (96/4=24MHz) is the highest freq. For clock details see Meadow's board.h
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval |= ADC_CCR_ADCPRE_DIV4;    // 01=ADC prescaler PCLK2 divided by 4

  // DMA access mode for multi ADC mode
  // 00: DMA mode disabled
  // 01: DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)
  // 10: DMA mode 2 enabled (2 / 3 half-words by pairs - 2&1 then 1&3 then 3&2)
  // 11: DMA mode 3 enabled (2 / 3 bytes by pairs - 2&1 then 1&3 then 3&2)
  regval &= ~ADC_CCR_DMA_MASK;       // Clear any bits in DMA mode (multi-ADC mode only) 
  regval |= ADC_CCR_DMA_DISABLED;    // 00 = DMA Modes (multi-ADC mode only)
  // regval |= (1 << ADC_CCR_DMA_SHIFT) // 01: DMA mode 1 enabled
  // regval |= (2 << ADC_CCR_DMA_SHIFT) // 10: DMA mode 2 enabled
  // regval |= (3 << ADC_CCR_DMA_SHIFT) // 11: DMA mode 3 enabled

  regval &= ~ADC_CCR_DDS;         // 0=No new DMA request is issued after the last transfer
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;    // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  return OK;
}

//================================================================
// Enable ADC
static void adc_enable(void)
{
  uint32_t regval;

  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait a bit
  usleep(400);
}

//================================================================
// Start ADC
static void adc_start(void)
{
  uint32_t regval;

  // // Now DMA2's SxCR register's will need to be re-enabled after each
  // // conversion. This is because it's cleared whenever an a DMA transfer
  // // has been completed.
  // regval  = getreg32(STM32_DMA2_S0CR);
  // regval |= DMA_SCR_EN;
  // putreg32(regval, STM32_DMA2_S0CR);

  // Start ADC conversion
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}

//================================================================
// Initialize DMA
static void dma_initialize(void)
{
  uint32_t regval;

