WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
// FOR DMA-SEEMS TO BE NO DIFFERENCE BETWEEN NUTTX AND DIRECT REGISTER VERSIONS
#if (1)   // Use Nuttx code
  // // Using Nuttx DMA module to handle DMA setup
  // if(_dmaHandle != NULL)
  // {
  //   // Needed only if previous dma being modified.
  //   stm32_dmastop(_dmaHandle);
  //   stm32_dmafree(_dmaHandle); 
  // }
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval |=  DMA_SCR_MSIZE_16BITS;  // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  // regval |= DMA_SCR_CIRC;           // Circular mode 1=enabled
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_BASE + STM32_ADC_DR_OFFSET, // Peripheral addr
                 (uint32_t) _dmaDataBuf,    // Destination buffer
                 _gpioTransferCount,        // number to transfers
                 regval);

  // Provide DMA callback
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  stm32_dmastart(_dmaHandle, adc_dma_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE, false);
  
  // Don't want 1/2 transfer ISR calls, above doesn't seem to honor 'false'
  regval = getreg32(STM32_DMA2_S0CR);
  regval &= ~DMA_SCR_HTIE;
  putreg32(regval, STM32_DMA2_S0CR);

#else
//------------------------------------------------------------
  // (--) PLAN B - Stop using Nuttx DMA code
  // Use direct register code
  // ADC1 DMA can be found here:DMA2, DMA_STREAM0, DMA_CHAN0
  // regval = getreg32(STM32_DMA2_S0CR);
  // regval &= ~DMA_SCR_EN;      // Clear the enable bit
  // putreg32(regval, STM32_DMA2_S0CR);

  // // Per Ref Man 8.3.18 must wait till 0
  // while ((getreg32(STM32_DMA2_S0CR) & DMA_SCR_EN) != 0);

  // Insure the DMA clock is on.
  regval = getreg32(STM32_RCC_APB1ENR);
  regval |= RCC_AHB1ENR_DMA2EN;
  putreg32(regval, STM32_RCC_APB1ENR);

  // Offset to DMA2 Stream 0 Control Register
  regval = getreg32(STM32_DMA2_S0CR);
  
  // Clear all the bits that can be set
  regval &= 0xe0000000;
  // NOT NEEDED HERE IT'S DONE BELOW
  putreg32(regval, STM32_DMA2_S0CR);

  // Select the Channel 0 by clearing (0000)
  // DIFFERENCE?? SAMPLE USES 0x7 DMA_SCR_CHSEL_MASK IS 0xf
  regval &= ~(7<<DMA_SCR_CHSEL_SHIFT);

  // (--) Trying Double-Buffer mode
  // The CT bit reveals which buffer is being filled
  // CT = 0 -> Memory 0
  // CT = 1 -> Memory 1  
  // regval |= DMA_SCR_DBM;
  // (--) Trying Double-Buffer mode

  // Set the memory size (MSIZE) is 16-bits 01
  // regval &= ~DMA_SCR_MSIZE_MASK;    // Clear both bits
  regval |= DMA_SCR_MSIZE_16BITS;   // Set size
  // Set the peripheral size (PSIZE) is 16-bits 01 
  // regval &= ~DMA_SCR_PSIZE_MASK;    // Clear both bits
  regval |= DMA_SCR_PSIZE_16BITS;   // Set size
  // Enable Memory Address Increment (MINC)
  // PINC is left 0 to not increment
  regval |= DMA_SCR_MINC;   // For 16-bit values incrementes by 2

  // Set Circular mode
  // regval |= DMA_SCR_CIRC;
  // Set direction as Peripheral to Memory
  regval &= ~DMA_SCR_DIR_MASK;    // Clear both bits
  regval |= DMA_SCR_DIR_P2M;
  putreg32(regval, STM32_DMA2_S0CR);

  // Per Ref Man 8.3.18 must wait
  // while ((getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET) & ADC_CR2_ADON) != 0);

  // DMA2 Channel 0 Number of Data Transfer Register
  regval = getreg32(STM32_DMA2_S0NDTR);
  // regval &= ~0x0000ffff;      // Clear 15:0
  // // regval |= xferSize;
  regval = _gpioTransferCount;
  putreg32(regval, STM32_DMA2_S0NDTR);

  // DMA2 Channel 0 Peripheral Register
  regval = getreg32(STM32_DMA2_S0PAR);
  // regval = sourceAddr;
  regval = STM32_ADC1_BASE + STM32_ADC_DR_OFFSET;
  putreg32(regval, STM32_DMA2_S0PAR);

  // DMA2 Channel 0 Memory Address Register 0
  regval = (uint32_t)_dmaDataBuffer1;
  putreg32(regval, STM32_DMA2_S0M0AR);

  // regval = getreg32(STM32_DMA2_S0CR);
  // (--) CALLING DMA ISR NEED WORK-THE CODE NEEDED TO ASSIGN THE ISR ISN'T WRITTEN
  // //       1/2 full         full          transfer err  Direct Mode err
  // regval |= DMA_SCR_HTIE | DMA_SCR_TCIE | DMA_SCR_TEIE | DMA_SCR_DMEIE;
  // putreg32(regval, STM32_DMA2_S0CR);

  // Enable DMA Stream.
  regval = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

#endif    // #if(0)
}

//================================================================
// Call all the sub-initialization functions
int meadow_adc_initialize(void)
{
  int ret;
  static bool firstTime = true;
  syslog(1, "--> Entered meadow_adc_initialize()\n"); usleep(20 * 1000);

  if(firstTime)
  {
    firstTime = false;
    _dmaHandle = NULL;
    memset(_dmaDataBuf, 0, _adcBufSzBytes);

    _noChangeCnt = 0;
  }
  else
  {
    syslog(1, "Please, only once\n");
    return -EALREADY;
  }

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
    return ret;
  }

  ret = adc_initialize();
  if(ret < 0)
  {
    syslog(1, "Error calling adc_initialize\n"); usleep(20 * 1000);
    return ret;
  }

  dma_initialize();

  adc_enable();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);
  
  _meadowAdcInit = true;

  // ADC with DMA should be running at this point
  syslog(1, "--> Exiting ADC config\n"); usleep(20 * 1000);

  return OK;
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// As few as 1 GPIO with 1 buffer element and as many as 16 GPIOs with a buffer
// limit not specified. However. the number of GPIOs must be an even multiple
// of the buffer.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          uint16_t *userDataBuf, uint32_t adcBufSzBytes)
{
  syslog(1, "meadow_adc configuration. gpioCount:%lu, adcBufSzBytes:%lu, userDataBuf:%p\n",
            gpioCount, adcBufSzBytes, userDataBuf);

  // (--) SINCE API NOT TOTALLY NAILED DOWN, WON'T DO TESTING UNTIL IT'S FINALIZED
  // uint32_t gpioListOff;
  // uint32_t mapOff = 0;

  // uint32_t userBufElements;
  // if(userDataBuf == NULL)
  // {
  //   syslog(1, "%s@%d-Error:userDataBuf is NULL\n",
  //             __FILE__, __LINE__, adcBufSzBytes);
  //   return -EINVAL;   // Invalid argument
  // }
  
