WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // // Data elements are 2 bytes, therefore, size must be even number
  // if(adcBufSzBytes % 2)
  // {
  //   syslog(1, "%s@%d-Error:ADC values are always 16-bits and adcBufSzBytes is not even (%lu)\n",
  //             __FILE__, __LINE__, adcBufSzBytes);
  //   return -EINVAL;   // Invalid argument
  // }

  // // Each element is 2 bytes
  // userBufElements = adcBufSzBytes/2;

  // // Must have at least 1 entry per gpio
  // if(gpioCount < userBufElements)
  // {
  //   syslog(1, "%s@%d-Error:gpioCount:%lu < userBufElements:%lu\n",
  //             __FILE__, __LINE__, gpioCount, userBufElements);
  //   return -EINVAL;   // Invalid argument
  // }

  // // Verify GPIO list is valid
  // for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  // {
  //   // Look for matching port/pin in the list
  //   for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
  //   {
  //     if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
  //       break;   // Found-it's connected to the ADC
  //   }

  //   // Did we go through the entire list and not find a match?
  //   if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
  //   {
  //     syslog(LOG_INFO, "GPIO:0x%02x (P%c%d) not connected to ADC\n", gpioList[gpioListOff],
  //                 (gpioList[gpioListOff] >> 4) + 'A', gpioList[gpioListOff] & 0x0f);
  //     return -EINVAL;   // Invalid argument
  //   }
  // }

  // // Will the number of GPIOs exactly fill the provided buffer?
  // if(gpioCount % userBufElements != 0)
  // {
  //   // Don't allow empty buffer slots as it's likely the user made an unintended error.
  //   syslog(1, "%s@%d-Error:buffer size and the number of GPIOs not multiple.\n",
  //               __FILE__, __LINE__);
  //   return -EINVAL;   // Invalid argument
  // }

  // Populate global values
  _gpioList = gpioList;
  _gpioTransferCount = gpioCount;
  _userDataBuf = userDataBuf;
  _adcBufSzBytes = adcBufSzBytes;

  // Signaling semaphore
  sem_init(&_waitTillDoneSem, 0, 0);
  sem_setprotocol(&_waitTillDoneSem, SEM_PRIO_NONE);  

  // Do before configuration
  // DON'T FREE the buffer's address as it's part of the DMA configuration
  _dmaDataBuf = kmm_malloc(_adcBufSzBytes);
  if(_dmaDataBuf == NULL)
  {
    syslog(1, "%s@%d-Error:Buffer space not available\n",
                __FILE__, __LINE__);
    return -ENOMEM;   // Out of memory
  }

  meadow_adc_initialize();

  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  if(! _meadowAdcInit)
  {
    syslog(1, "%s@%d-Error:Meadow ADC not initialized.\n", __FILE__, __LINE__);
    usleep(20 * 1000);
    return -EPERM;    // Operation not permitted
  }

  // Start the conversion
  adc_start();
  
  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_waitTillDoneSem);

  // Note to execute the following display takes about 26 ms
  // Show data before copy
  static int callCount = 0;
  callCount++;
  syslog(1, "%04d-noChgCnt:%05d\n", callCount, _noChangeCnt);
  show_all_data_in_buffer("ADC", _dmaDataBuf, _gpioTransferCount);

  // Conversion must be complete. Now time to copy collected data to user
  // buffer and return
  memcpy(_userDataBuf, _dmaDataBuf, _adcBufSzBytes);

  return OK;
}

//==========================================================================
void show_all_data_in_buffer(char *headerText, uint16_t dataBuffer[],
                            uint32_t dataBufElements)
{
#define DMA_ISR_DISP_MAX_PER_ROW (8)    // 8 elements / row
#define DMA_ISR_DISP_VAL_LEN (5)        // Data values take 5 char
#define DMA_ISR_DISP_LEADER_LEN (9)     // Addr takes 9 chars

  uint32_t dmaBuffOff = 0;
  int columnCnt;
  int lineBuffOff;
  int disp_max_per_row = DMA_ISR_DISP_MAX_PER_ROW;

  if(disp_max_per_row > dataBufElements)
    disp_max_per_row = dataBufElements;

  int disp_char_per_row = (disp_max_per_row * DMA_ISR_DISP_VAL_LEN);
  int disp_total_line_len = disp_char_per_row + DMA_ISR_DISP_LEADER_LEN;
  char lineBuff[disp_total_line_len + 1];    // Room for NULL

  do
  {
    lineBuffOff = 0;
    snprintf(&lineBuff[lineBuffOff], disp_total_line_len, "%08x ", dmaBuffOff);
    lineBuffOff = DMA_ISR_DISP_LEADER_LEN;

    // Build a full row of data then print it
    for(columnCnt = 0; columnCnt < disp_max_per_row; columnCnt++)
    {
      snprintf(&lineBuff[lineBuffOff],
                disp_char_per_row - (columnCnt * DMA_ISR_DISP_VAL_LEN),
                "%04u ", dataBuffer[dmaBuffOff++]);
      lineBuffOff += DMA_ISR_DISP_VAL_LEN;
    }

    lineBuff[(lineBuffOff) + 1] = '\0';
    syslog(1, "%s:%s\n", headerText, lineBuff);

    // Line by line show entire buffer
  } while (dmaBuffOff < dataBufElements);
}
